[
  {
    "title": "NYU Abu Dhabi co-leads record-breaking 6G trial",
    "url": "https://nyunews.com/news/2025/11/7/nyu-abu-dhabi-terahertz-trial-record-speeds/",
    "date": "2025-11-07",
    "word_count": 377,
    "summary": "NYU Abu Dhabi co-led a 6G Terahertz trial that achieved record transmission speeds of 145 Gbps, advancing wireless communications technology beyond current 5G technology. The new trial between NYUAD Wireless Center and the technology investment firm e& UAE will allow for higher speed, larger volume data transmission and minimal network..."
  },
  {
    "title": "2 Othmer floods leave students stranded",
    "url": "https://nyunews.com/news/2025/11/7/nyu-othmer-hall-flooding/",
    "date": "2025-11-07",
    "word_count": 814,
    "summary": "Several floors at Othmer Hall flooded after two pipes burst on Thursday, leaving pools of water over the building’s lobby and nearly two dozen suites and forcing some students to find alternative housing for the night. The first pipe burst in a seventh-floor dorm at 11:20 a.m., quickly soaking the..."
  },
  {
    "title": "‘Nobody feels secure’: NYU Shanghai to ax 50 contract faculty",
    "url": "https://nyunews.com/news/2025/11/06/nyu-shanghai-terminates-faculty-contracts/",
    "date": "2025-11-06",
    "word_count": 564,
    "summary": "NYU Shanghai terminated at least 10 out of 30 contracts with faculty members who applied for reappointment and aims to eliminate around 40 more positions, moving forward with a long-term hiring recomposition to host more tenured faculty. Around 67% of professors at the site are contract faculty and 33% are..."
  },
  {
    "title": "NYU biologists study marine life on UAE research ship",
    "url": "https://nyunews.com/news/2025/11/06/abu-dhabi-leads-marine-missions-exploring-arabian-gulf/",
    "date": "2025-11-06",
    "word_count": 391,
    "summary": "NYU researchers found the Arabian Gulf’s climate resilience to be “ surprisingly high ” in a marine biology study aboard The Environmental Agency – Abu Dhabi-owned research vessel, “Jaywun.” The study’s discoveries could lead to further research into the effects of microorganisms adapting to global warming. The team of 10..."
  },
  {
    "title": "Tandon researchers advance eco-friendly infrared detectors",
    "url": "https://nyunews.com/news/2025/11/3/tandon-eco-friendly-infrared-detectors/",
    "date": "2025-11-03",
    "word_count": 378,
    "summary": "Tandon researchers found that semiconducting material may offer a safer and cheaper alternative to the toxic heavy-metal compounds typically used in infrared detectors because of its capacity for near to short-wave infrared detection. IR tracks movements through body heat and is commonly used for night cameras and health screenings. The..."
  }
]