[
  {
    "title": "Faculty union rejects admin offer to hire mediator",
    "url": "https://nyunews.com/news/2025/10/31/nyu-fcu-mediator-repsonse/",
    "date": "2025-10-31",
    "word_count": 506,
    "summary": "NYU’s contract faculty union rejected administrators’ push to hire a third-party to mediate its negotiation sessions, claiming that the university is stalling on at least 14 proposals related to faculty wages, academic freedom and data privacy. NYU spokesperson John Beckman said on Wednesday that in an effort to “spur progress”..."
  },
  {
    "title": "NYU unveils most powerful supercomputer in New York state",
    "url": "https://nyunews.com/news/2025/10/31/nyu-torch-supercomputer-launched/",
    "date": "2025-10-31",
    "word_count": 391,
    "summary": "NYU’s new supercomputer, launched earlier this month, is now the most powerful in New York state and across any higher education institution in the country. Five times faster than the university’s current supercomputer, “ Torch ” is programmed to meet increasing demands of researchers at NYU. The supercomputer is a..."
  },
  {
    "title": "Professors criticize Trump compact at town hall",
    "url": "https://nyunews.com/news/2025/10/30/aa-uptown-hall/",
    "date": "2025-10-30",
    "word_count": 764,
    "summary": "Professors across East Coast universities called for institutions to reject President Donald Trump’s contract offering “ multiple positive benefits ” to schools that meet a series of his political demands at an American Association of University Professors town hall at NYU’s Cantor Film Center on Tuesday. At the event, held..."
  },
  {
    "title": "Diplomats discuss international law at NYU French house",
    "url": "https://nyunews.com/news/2025/10/20/international-french-law-event/",
    "date": "2025-10-20",
    "word_count": 461,
    "summary": "A panel of U.S. and French diplomats discussed the current state of international law and global conflicts at NYU’s La Maison Française Tuesday evening, as part of its two-year partnership with Normandie Pour La Paix. Organized by Guy Sorman, founder and honorary president of Action Contre La Faim, the event..."
  },
  {
    "title": "Beyond NYU: From playing the game to building the game",
    "url": "https://nyunews.com/news/2025/10/30/zeke-virant-beyond-9/",
    "date": "2025-10-30",
    "word_count": 868,
    "summary": "Two decades before Zeke Virant helped build award-winning video games, he was a 10-year-old who was first exposed to the gaming world through his Apple II computer. That’s when he joined online messaging boards to team up with friends to practice their gaming skills. The player community was small then,..."
  }
]